Documents/бит_РасчетПредельногоИндекса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_РасчетПредельногоИндекса</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.бит_РасчетПредельногоИндексаПоУслугамЖКХ</xr:Item>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХ</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.бит_НачисленияПоУслугамЖКХПоПериоду</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВводВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаУслуги</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
								<v8:Type>cfg:CatalogRef.бит_ГруппыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдИзм</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начислено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленоДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Норма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПоНормативам</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПоНормативамДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемПоСчетчикам</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодСравнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановаяСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлановаяСтавкаДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказанияСчетчика</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Превышение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПревышениеВПроцентах</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредельныйИндекс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СверхномСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СверхномСтавкаДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СверхНорма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНедополученныхДоходов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАбонента</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКУ</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/бит_НачисленияПоУслугамЖКХПоПериоду.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияПоУслугамЖКХПоПериоду</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>лб_ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидНачисленияПоУслугамЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/бит_РасчетПредельногоИндекса/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПеременныеМодуля

Перем мРасчетДолей                        Экспорт;  // Хранит флаг настройки ЖКХ.
Перем мУменьшитьНормуЛьготы               Экспорт;  // Хранит флаг настройки ЖКХ.
Перем мУчетДнейПРоживания                 Экспорт;  // Хранит флаг настройки ЖКХ.
Перем мОбщедомовыеРасходыВГрафеНачисления Экспорт;  // Хранит флаг настройки ЖКХ.
Перем мСчетчикиПодкрутка                  Экспорт;  // Хранит флаг настройки ЖКХ.
Перем мЛьготаПерсонифицированная          Экспорт;  // Хранит флаг настройки ЖКХ.
Перем мРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика Экспорт; // Хранит флаг настройки ЖКХ.

// БИТ_ЖКХ_06102013_начало_изменений
Перем мРаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика Экспорт; // Хранит флаг настройки ЖКХ.
// БИТ_ЖКХ_06102013_окончание_изменений

#КонецОбласти

#Область ЭкспортныеПроцедурыИФункцииДокумента

Процедура ОбновитьПараметрыЖКХ() Экспорт
	
	ПараметрыЖКХ = Новый Структура;
	ПараметрыЖКХ.Вставить("РасчетСУчетомДолейВладения"         , Ложь);
	ПараметрыЖКХ.Вставить("УменьшениеНормыЛьготыВПределахФакта", Ложь);
	ПараметрыЖКХ.Вставить("НачислениеСУчетомДнейПроживания"    , Ложь);
	ПараметрыЖКХ.Вставить("ОбщедомовыеРасходыВГрафеНачисления" , Ложь);
	ПараметрыЖКХ.Вставить("СчетчикиПодкрутка"                  , Ложь);
	ПараметрыЖКХ.Вставить("ЛьготаПерсонифицированная"          , Ложь); 	
	ПараметрыЖКХ.Вставить("РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
	
	// БИТ_ЖКХ_06102013_начало_изменений
	ПараметрыЖКХ.Вставить("РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
	// БИТ_ЖКХ_06102013_окончание_изменений
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецМесяца(Дата), Организация, ПараметрыЖКХ);
	
	мРасчетДолей          = ПараметрыЖКХ.РасчетСУчетомДолейВладения;
	мУменьшитьНормуЛьготы = ПараметрыЖКХ.УменьшениеНормыЛьготыВПределахФакта;
	мУчетДнейПРоживания   = ПараметрыЖКХ.НачислениеСУчетомДнейПроживания;
	
	мОбщедомовыеРасходыВГрафеНачисления = ПараметрыЖКХ.ОбщедомовыеРасходыВГрафеНачисления;
	мСчетчикиПодкрутка                  = ПараметрыЖКХ.СчетчикиПодкрутка;
	мЛьготаПерсонифицированная          = ПараметрыЖКХ.ЛьготаПерсонифицированная;
	
	мРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика = ПараметрыЖКХ.РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика;
	
	// БИТ_ЖКХ_06102013_начало_изменений
	мРаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика = ПараметрыЖКХ.РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика;
	// БИТ_ЖКХ_06102013_окончание_изменений
	
КонецПроцедуры

Процедура ВыполнитьРасчет() Экспорт
	
	Начисления.Очистить();
	
	ОбновитьПараметрыЖКХ();
	
	СписокЛС     = Новый Массив;
	СписокЗданий = Новый Массив;
	
	СписокЗданий.Добавить(Здание);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
	|ИЗ
	|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|ГДЕ
	|	бит_ЛицевыеСчета.Здание = &Здание
	|	И бит_ЛицевыеСчета.УлицаЛицевогоСчета = &УлицаЛицевогоСчета";
	
	Запрос.УстановитьПараметр("УлицаЛицевогоСчета", Улица);
	Запрос.УстановитьПараметр("Здание"            , Здание);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	СписокЛС = Результат.ВыгрузитьКолонку("ЛицевойСчет");
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_НачисленияПоСчетчикам.Дата
	|ИЗ
	|	Документ.бит_НачисленияПоСчетчикам КАК бит_НачисленияПоСчетчикам
	|ГДЕ
	|	бит_НачисленияПоСчетчикам.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И бит_НачисленияПоСчетчикам.Улица = &Улица
	|	И бит_НачисленияПоСчетчикам.Здание = &Здание
	|	И бит_НачисленияПоСчетчикам.Организация = &Организация";
	
	Запрос.УстановитьПараметр("ДатаНачала"    , НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("ДатаОкончания" , КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Улица"         , Улица);
	Запрос.УстановитьПараметр("Здание"        , Здание);
	Запрос.УстановитьПараметр("Организация"   , Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДатаЗапроса = Дата(1,1,1);
	
	Пока Выборка.Следующий() Цикл
		
		ДатаЗапроса = Выборка.Дата;
		
	КонецЦикла;
	
	ТаблицаНачислений = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуНачислений();
	
	Если ДатаЗапроса = Дата(1,1,1) Тогда
		
		ТаблицаСчетчиков = Неопределено;
		
	Иначе
		
		ТаблицаСчетчиков  = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуСчетчиков();
		
	КонецЕсли;
	
	бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисления(ДатаЗапроса, 
	Организация, 
	СписокЛС, 
	СписокЗданий, 
	, 
	, 
	ТаблицаНачислений, 
	ТаблицаСчетчиков, 
	, 
	,
	,
	,
	мРасчетДолей,
	мУменьшитьНормуЛьготы, 
	мУчетДнейПРоживания, 
	, 
	,
	// БИТ_ЖКХ_06102013_начало_изменений
	// мРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика);.
	мРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика,
	мРаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика);
	// БИТ_ЖКХ_06102013_окончание_изменений
	
	// Начисление по лицевым счетам.
	Если ТаблицаНачислений.Количество() > 0 Тогда
		
		бит_РасчетыПоКоммунальнымУслугам.ДобавитьКолонкиБухУчета(ТаблицаНачислений);
		ЗаполнениеСчетовКУ(ТаблицаНачислений);		
		
		Для каждого СтрокаНачислений Из ТаблицаНачислений Цикл
			
			Если СтрокаНачислений.НачислятьПредельныйИндекс Тогда
				
				СтрокаНачисления = Начисления.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаНачисления, СтрокаНачислений);
				
				Если СтрокаНачислений.ГруппаУслуги = Справочники.бит_ГруппыУслуг.ПустаяСсылка() Тогда
					
					СтрокаНачисления.ГруппаУслуги    = СтрокаНачислений.Услуга;
					
				КонецЕсли;
				
				СтрокаНачисления.Поставщик            = СтрокаНачислений.МойПоставщик;
				СтрокаНачисления.ОбъемПоНормативамДо  = СтрокаНачислений.ОбъемДо;
				СтрокаНачисления.ОбъемПоНормативам    = СтрокаНачислений.Объем;
				// БИТ_ЖКХ_10012014_начало_изменений
				СтрокаНачисления.ПоказанияСчетчика    = 0;
				// БИТ_ЖКХ_10012014_окончание_изменений
				СтрокаНачисления.ОбъемПоСчетчикам     = 0;
				СтрокаНачисления.Превышение           = СтрокаНачислений.Начислено - (СтрокаНачислений.НачисленоДо * (1 + (СтрокаНачислений.ПредельныйИндекс/100)));
				СтрокаНачисления.ПревышениеВПроцентах = ?(СтрокаНачислений.НачисленоДо = 0, 0, 
				(СтрокаНачислений.Начислено * 100) /(СтрокаНачислений.НачисленоДо * (1 + (СтрокаНачислений.ПредельныйИндекс/100))));
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Начисление по счетчикам.	
	Если ТаблицаСчетчиков <> Неопределено Тогда
		
		ТаблицаСчетчиков.Свернуть("ЛицевойСчет, Услуга, Ставка, СверхномСтавка, Тариф, ТарифДо, СтавкаДо, СверхномСтавкаДо, ПредельныйИндекс, НачислятьПредельныйИндекс, ГруппаУслуги, ПериодСравнения, ПлановаяСтавка, ПлановаяСтавкаДо, МойПоставщик, ЕдИзм","Факт, Начислено, НачисленоДо, Норма, СверхНорма, Объем, КоличествоЕдиниц");
		
		Если ТаблицаСчетчиков.Количество() > 0 Тогда
			
			бит_РасчетыПоКоммунальнымУслугам.ДобавитьКолонкиБухУчета(ТаблицаСчетчиков);
			ЗаполнениеСчетовКУ(ТаблицаСчетчиков);
			
			Для каждого СтрокаСчетчиков Из ТаблицаСчетчиков Цикл
				
				Если СтрокаСчетчиков.НачислятьПредельныйИндекс Тогда
					
					СтрокаНачисления = Начисления.Добавить();
					
					ЗаполнитьЗначенияСвойств(СтрокаНачисления, СтрокаСчетчиков);
					
					Если СтрокаСчетчиков.ГруппаУслуги = Справочники.бит_ГруппыУслуг.ПустаяСсылка() Тогда
						
						СтрокаНачисления.ГруппаУслуги    = СтрокаСчетчиков.Услуга;
						
					КонецЕсли;
					
					СтрокаНачисления.Поставщик            = СтрокаСчетчиков.МойПоставщик;
					СтрокаНачисления.ОбъемПоНормативамДо  = 0;
					СтрокаНачисления.ОбъемПоНормативам    = 0;
					// БИТ_ЖКХ_10012014_начало_изменений
					СтрокаНачисления.ПоказанияСчетчика    = СтрокаСчетчиков.КоличествоЕдиниц;
					// БИТ_ЖКХ_10012014_окончание_изменений
					СтрокаНачисления.ОбъемПоСчетчикам     = СтрокаСчетчиков.Объем;
					СтрокаНачисления.Превышение           = СтрокаСчетчиков.Начислено - (СтрокаСчетчиков.НачисленоДо * (1 + (СтрокаСчетчиков.ПредельныйИндекс/100)));
					СтрокаНачисления.ПревышениеВПроцентах = ?(СтрокаСчетчиков.НачисленоДо = 0, 0, 
					(СтрокаСчетчиков.Начислено * 100) /(СтрокаСчетчиков.НачисленоДо * (1 + (СтрокаСчетчиков.ПредельныйИндекс/100))));
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Начисления.Сортировать("ЛицевойСчет Возр, ГруппаУслуги Возр, Услуга Возр");
	
	Для Каждого СтрокаТЧ Из Начисления Цикл
		
		ОтборТЧ = Новый Структура;
		
		ОтборТЧ.Вставить("ЛицевойСчет", СтрокаТЧ.ЛицевойСчет);
		
		Если СтрокаТЧ.ГруппаУслуги = Справочники.бит_ГруппыУслуг.ПустаяСсылка() Тогда
			
			ОтборТЧ.Вставить("Услуга", СтрокаТЧ.Услуга);
			
		Иначе
			
			ОтборТЧ.Вставить("ГруппаУслуги", СтрокаТЧ.ГруппаУслуги);
			
		КонецЕсли;
		
		МассивТЧ = Начисления.НайтиСтроки(ОтборТЧ);
		
		ИтогПоГруппе                   = 0;
		ИтогоПревышение                = 0;
		КоличествоЭлементовВГруппе     = МассивТЧ.Количество();
		ПоследнийНомерСтрокиПревышения = 0;
		НомСтр                         = 0;
		
		Для Каждого ЭлементМассива Из МассивТЧ Цикл
			
			НомСтр = НомСтр + 1;
			
			ИтогПоГруппе = ИтогПоГруппе + ЭлементМассива.Начислено - (ЭлементМассива.НачисленоДо * (1 + (ЭлементМассива.ПредельныйИндекс/100)));
			
			Если ЭлементМассива.Превышение > 0 Тогда
				
				ИтогоПревышение = ИтогоПревышение + ЭлементМассива.Превышение;
				
				ПоследнийНомерСтрокиПревышения = НомСтр;
				
			КонецЕсли;
			
		КонецЦикла;
		
		НомерСтр                   = 0;
		ОстатокПоГруппе            = ИтогПоГруппе;
		
		Для Каждого ЭлементМассива Из МассивТЧ Цикл
			
			Если ОстатокПоГруппе > 0 Тогда
				
				НомерСтр = НомерСтр + 1;
				
				Если НомерСтр = ПоследнийНомерСтрокиПревышения Тогда
					
					ЭлементМассива.СуммаНедополученныхДоходов = ОстатокПоГруппе;
					
				Иначе
					
					Если ЭлементМассива.Превышение > 0 Тогда
						
						РасчетнаяСумма = Окр(ИтогПоГруппе / ИтогоПревышение * ЭлементМассива.Превышение,2,1);
						
					Иначе
						
						РасчетнаяСумма = 0;
						
					КонецЕсли;
					
					ЭлементМассива.СуммаНедополученныхДоходов = РасчетнаяСумма;
					
					ОстатокПоГруппе = ОстатокПоГруппе - РасчетнаяСумма;
					
				КонецЕсли;
				
			Иначе
				
				ЭлементМассива.СуммаНедополученныхДоходов = 0;
				
			КонецЕсли;
			
		КонецЦикла;	
		
	КонецЦикла;
	
	ВводВручную = Ложь;
	
КонецПроцедуры

// Процедура выполняет заполнение Счетов и Субконто.
//
Процедура ЗаполнениеСчетовКУ(ТабНачисления=Неопределено) Экспорт 
	
	Если ТабНачисления=Неопределено тогда
		
		СписокЛС = Начисления.ВыгрузитьКолонку("ЛицевойСчет");
		Колонки  = Начисления.ВыгрузитьКолонки().Колонки;
		
		бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(Начисления, Колонки, СписокЛС, Организация , Дата,,,,,,Истина);
		
	Иначе
		
		СписокЛС = ТабНачисления.ВыгрузитьКолонку("ЛицевойСчет");
		Колонки  = ТабНачисления.Колонки;
		
		бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(ТабНачисления, Колонки, СписокЛС, Организация , Дата,,,,,,Истина);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

Процедура ПервоначальноеЗаполнениеДокумента(ПараметрОбъектКопирования = Неопределено)
	
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект
	
	// БИТ_ЖКХ 10.02.2014
	//,глЗначениеПеременной("глТекущийПользователь")
	,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь")
	// БИТ_ЖКХ 10.02.2014
	
	,ПараметрОбъектКопирования);
	
	Дата = КонецМесяца(ТекущаяДата());
	
КонецПроцедуры

// Выполняет движения по регистрам. 
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоУслугам, Отказ, Заголовок)
	
	ДатаДока            = Дата;
	НачислениеПоУслугам = Движения.бит_НачисленияПоУслугамЖКХ;
	НачислениеПоРасчету = Движения.бит_РасчетПредельногоИндексаПоУслугамЖКХ;
	
	// БИТ_ЖКХ 15.03.2016 14:37:33 Начало правки...
	НачислениеПоУслПоПериоду = Движения.бит_НачисленияПоУслугамЖКХПоПериоду;
	// БИТ_ЖКХ 15.03.2016 14:37:33 Конец правки.
	
	Для каждого СтрокаТЧ Из ТаблицаПоУслугам Цикл
		
		ОтборТЧ = Новый Структура;
		
		ОтборТЧ.Вставить("ЛицевойСчет", СтрокаТЧ.ЛицевойСчет);
		
		Если СтрокаТЧ.ГруппаУслуги = Справочники.бит_ГруппыУслуг.ПустаяСсылка() Тогда
			
			ОтборТЧ.Вставить("Услуга", СтрокаТЧ.Услуга);
			
		Иначе
			
			ОтборТЧ.Вставить("ГруппаУслуги", СтрокаТЧ.ГруппаУслуги);
			
		КонецЕсли;
		
		МассивТЧ = Начисления.НайтиСтроки(ОтборТЧ);
		
		Итог = 0;                  
		
		Для Каждого ЭлементМассива Из МассивТЧ Цикл
			
			Итог = Итог + СтрокаТЧ.СуммаНедополученныхДоходов;
			
		КонецЦикла;
		
		Если Итог > 0 Тогда
			
			ДвижениеРасчет                                                                                    = НачислениеПоРасчету.Добавить();
			ДвижениеРасчет.Период                                                                             = ДатаДока;
			ДвижениеРасчет.ЛицевойСчет                                                                        = СтрокаТЧ.ЛицевойСчет;
			ДвижениеРасчет.УслугаЖКХ                                                                          = СтрокаТЧ.Услуга;
			ДвижениеРасчет.ГруппаУслуги                                                                       = СтрокаТЧ.ГруппаУслуги;
			ДвижениеРасчет.РесурсоснабжающаяОрганизация                                                       = СтрокаТЧ.Поставщик;
			ДвижениеРасчет.ЕдиницаИзмерения                                                                   = СтрокаТЧ.ЕдИзм;
			ДвижениеРасчет.ПериодСравнения                                                                    = СтрокаТЧ.ПериодСравнения;
			ДвижениеРасчет.Количество                                                                         = СтрокаТЧ.Факт;
			ДвижениеРасчет.СтавкаУстановленнаяВПериодеСравнения                                               = СтрокаТЧ.СтавкаДо;
			ДвижениеРасчет.СтавкаУстановленнаяВТекущемПериоде                                                 = СтрокаТЧ.Ставка;
			ДвижениеРасчет.Норма                                                                              = СтрокаТЧ.Норма;
			ДвижениеРасчет.СверхнормативнаяСтавкаУстановленнаяВПериодеСравнения                               = СтрокаТЧ.СверхномСтавкаДо;
			ДвижениеРасчет.СверхнормативнаяСтавкаУстановленнаяВТекущемПериоде                                 = СтрокаТЧ.СверхномСтавка;
			ДвижениеРасчет.Сверхнорма                                                                         = СтрокаТЧ.СверхНорма;
			ДвижениеРасчет.ПлановаяСтавкаУстановленнаяВПериодеСравнения                                       = СтрокаТЧ.ПлановаяСтавкаДо;
			ДвижениеРасчет.ПлановаяСтавкаУстановленнаяВТекущемПериоде                                         = СтрокаТЧ.ПлановаяСтавка;
			ДвижениеРасчет.ТарифУстановленныйВПериодеСравнения                                                = СтрокаТЧ.ТарифДо;
			ДвижениеРасчет.ТарифУстановленныйВТекущемПериоде                                                  = СтрокаТЧ.Тариф;
			ДвижениеРасчет.МесячныйОбъемКоммунальныхУслугРассчитанныйПоНормативамВПериодеСравнения            = СтрокаТЧ.ОбъемПоНормативамДо;
			ДвижениеРасчет.МесячныйОбъемКоммунальныхУслугРассчитанныйПоНормативамВТекущемПериоде              = СтрокаТЧ.ОбъемПоНормативам;
			ДвижениеРасчет.МесячныйОбъемКоммунальныхУслугРассчитанныйПоПоказаниямПриборовУчетаВТекущемПериоде = СтрокаТЧ.ОбъемПоСчетчикам;
			ДвижениеРасчет.ПредельныйИндекс                                                                   = СтрокаТЧ.ПредельныйИндекс;
			ДвижениеРасчет.ПлатаГражданЗаКоммунальныеУслугиСУчетомТарифаПрименяемогоВПериодеСравнения         = СтрокаТЧ.НачисленоДо;
			ДвижениеРасчет.ПлатаГражданЗаКоммунальныеУслугиСУчетомТарифаПрименяемогоВТекущемПериоде           = СтрокаТЧ.Начислено;
			ДвижениеРасчет.ПревышениеСовокупнойПлатыГражданЗаКоммунальныеУслугиСУчетомПредельныхИндексов      = СтрокаТЧ.Превышение; 
			ДвижениеРасчет.СуммаНедополученныхДоходов                                                         = СтрокаТЧ.СуммаНедополученныхДоходов;
			ДвижениеРасчет.ПревышениеВПроцентах                                                               = СтрокаТЧ.ПревышениеВПроцентах;
			// БИТ_ЖКХ_10012014_начало_изменений
			ДвижениеРасчет.ПоказанияСчетчиков                                                                 = СтрокаТЧ.ПоказанияСчетчика;                  
			// БИТ_ЖКХ_10012014_окончание_изменений
			
		КонецЕсли;
		
		Если СтрокаТЧ.СуммаНедополученныхДоходов > 0 Тогда
			
			Движение                             = НачислениеПоУслугам.ДобавитьРасход();
			Движение.Сумма                       = СтрокаТЧ.СуммаНедополученныхДоходов;	
			Движение.Период                      = ДатаДока;
			Движение.ЛицевойСчет                 = СтрокаТЧ.ЛицевойСчет;
			Движение.УслугаЖКХ                   = СтрокаТЧ.Услуга;
			
			// БИТ_ЖКХ 29.05.2014	
			Движение.Организация   = СтруктураШапкиДокумента.Организация;
			// БИТ_ЖКХ 29.05.2014
			
			// БИТ_ЖКХ 15.03.2016 14:38:05 Начало правки...
			ДвижениеУслПоПериоду = НачислениеПоУслПоПериоду.ДобавитьРасход();
			ДвижениеУслПоПериоду.Сумма				  = СтрокаТЧ.СуммаНедополученныхДоходов;	
			ДвижениеУслПоПериоду.Период				  = ДатаДока;
			ДвижениеУслПоПериоду.ПериодВзаиморасчетов = ДатаДока;
			ДвижениеУслПоПериоду.ЛицевойСчет		  = СтрокаТЧ.ЛицевойСчет;
			ДвижениеУслПоПериоду.УслугаЖКХ			  = СтрокаТЧ.Услуга;
			ДвижениеУслПоПериоду.Организация		  = СтруктураШапкиДокумента.Организация;
			// БИТ_ЖКХ 15.03.2016 14:38:05 Конец правки.
			
			Если ЗначениеЗаполнено(СтрокаТЧ.СчетАбонента) И ЗначениеЗаполнено(СтрокаТЧ.СчетКУ) Тогда 
				
				Проводка             = Движения.Хозрасчетный.Добавить();
				Проводка.Период      = СтруктураШапкиДокумента.Дата;
				Проводка.Содержание  = "Предельный индекс";
				Проводка.Организация = СтруктураШапкиДокумента.Организация;
				
				// БИТ_ЖКХ 18.03.2016 17:43:23 Начало правки... требование поменять местами дт и кт 
				//Проводка.СчетДт    = СтрокаТЧ.СчетАбонента;
				
				//БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.Субконто1);
				//БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.Субконто2);
				//БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.Субконто3);

				//Проводка.СчетКт    = СтрокаТЧ.СчетКУ;
				
				//БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.СубконтоКУ1);
				//БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТЧ.СубконтоКУ2);
				//БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.СубконтоКУ3);

				Проводка.СчетДт      = СтрокаТЧ.СчетКУ;
				
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.СубконтоКУ1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.СубконтоКУ2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.СубконтоКУ3);
				
				Проводка.СчетКт      = СтрокаТЧ.СчетАбонента;
				
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.Субконто1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТЧ.Субконто2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.Субконто3);
				// БИТ_ЖКХ 18.03.2016 17:43:21 Конец правки. 
				
				Проводка.Сумма       = СтрокаТЧ.СуммаНедополученныхДоходов;
				
				Если СтрокаТЧ.СчетКУ = ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД  Тогда
					
					Если ЗначениеЗаполнено(Проводка.СубконтоКт.СтавкиНДС) Тогда
						
						
						// БИТ_ЖКХ 10.02.2014
						// НДС_Ставка = УчетНДС.ПолучитьСтавкуНДС(Проводка.СубконтоКт.СтавкиНДС);.
						НДС_Ставка = УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(Проводка.СубконтоКт.СтавкиНДС);
						// БИТ_ЖКХ 10.02.2014
						
						Проводка.СуммаНУКт = СтрокаТЧ.Начислено - (СтрокаТЧ.Начислено * (НДС_Ставка / (100 + НДС_Ставка)));
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ)
	
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Сформируем структуру реквизитов шапки документа.
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Проверим правильность заполнения шапки документа.
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ЛицевойСчет"               , "ЛицевойСчет");
	СтруктураПолей.Вставить("ГруппаУслуги"              , "ГруппаУслуги");
	СтруктураПолей.Вставить("Услуга"                    , "Услуга");
	СтруктураПолей.Вставить("Поставщик"                 , "Поставщик");
	СтруктураПолей.Вставить("ЕдИзм"                     , "ЕдИзм");
	СтруктураПолей.Вставить("ПериодСравнения"           , "ПериодСравнения");
	СтруктураПолей.Вставить("Факт"                      , "Факт");
	СтруктураПолей.Вставить("СтавкаДо"                  , "СтавкаДо");
	СтруктураПолей.Вставить("Ставка"                    , "Ставка");
	СтруктураПолей.Вставить("Норма"                     , "Норма");
	СтруктураПолей.Вставить("СверхномСтавкаДо"          , "СверхномСтавкаДо");
	СтруктураПолей.Вставить("СверхномСтавка"            , "СверхномСтавка");
	СтруктураПолей.Вставить("СверхНорма"                , "СверхНорма");
	СтруктураПолей.Вставить("ПлановаяСтавкаДо"          , "ПлановаяСтавкаДо");
	СтруктураПолей.Вставить("ПлановаяСтавка"            , "ПлановаяСтавка");
	СтруктураПолей.Вставить("ТарифДо"                   , "ТарифДо");
	СтруктураПолей.Вставить("Тариф"                     , "Тариф");
	СтруктураПолей.Вставить("ОбъемПоНормативамДо"       , "ОбъемПоНормативамДо");
	СтруктураПолей.Вставить("ОбъемПоНормативам"         , "ОбъемПоНормативам");
	СтруктураПолей.Вставить("ОбъемПоСчетчикам"          , "ОбъемПоСчетчикам");
	СтруктураПолей.Вставить("ПредельныйИндекс"          , "ПредельныйИндекс");
	СтруктураПолей.Вставить("НачисленоДо"               , "НачисленоДо");
	СтруктураПолей.Вставить("Начислено"                 , "Начислено");
	СтруктураПолей.Вставить("Превышение"                , "Превышение");
	СтруктураПолей.Вставить("ПревышениеВПроцентах"      , "ПревышениеВПроцентах");
	СтруктураПолей.Вставить("СуммаНедополученныхДоходов", "СуммаНедополученныхДоходов");
	СтруктураПолей.Вставить("СчетАбонента"              , "СчетАбонента");
	СтруктураПолей.Вставить("Субконто1"                 , "Субконто1");
	СтруктураПолей.Вставить("Субконто2"                 , "Субконто2");
	СтруктураПолей.Вставить("Субконто3"                 , "Субконто3");
	СтруктураПолей.Вставить("СчетКУ"                    , "СчетКУ");
	СтруктураПолей.Вставить("СубконтоКУ1"               , "СубконтоКУ1");
	СтруктураПолей.Вставить("СубконтоКУ2"               , "СубконтоКУ2");
	СтруктураПолей.Вставить("СубконтоКУ3"               , "СубконтоКУ3");
	// БИТ_ЖКХ_10012014_начало_изменений
	СтруктураПолей.Вставить("ПоказанияСчетчика"         , "ПоказанияСчетчика");
	// БИТ_ЖКХ_10012014_окончание_изменений
	
	РезультатЗапросаПоУслугам = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Начисления", СтруктураПолей);
	
	ТаблицаПоУслугам          = РезультатЗапросаПоУслугам.Выгрузить();
	
	Если НЕ Отказ Тогда
		
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, ТаблицаПоУслугам, Отказ, Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

// Процедура - обработчик события "ОбработкаЗаполнения" .
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ПервоначальноеЗаполнениеДокумента();
	
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТЗСписокЛС = Начисления.Выгрузить(,"ЛицевойСчет");
	
	ТЗСписокЛС.Свернуть("ЛицевойСчет");
	
	СписокЛицевыхСчетов = "";
	
	Для каждого Строка Из ТЗСписокЛС Цикл
		
		Если ПустаяСтрока(Строка.ЛицевойСчет.Наименование) Тогда
			
			Продолжить;
			
		КонецЕсли; 
		
		Если СписокЛицевыхСчетов = "" Тогда
			
			СписокЛицевыхСчетов = ""+Строка.ЛицевойСчет.Наименование;
			
		Иначе
			
			СписокЛицевыхСчетов = ""+СписокЛицевыхСчетов +", " +Строка.ЛицевойСчет.Наименование;
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
